In [3]:
import pandas as pd

In [4]:
df = pd.read_csv("raw_bank_transactions.csv")

In [5]:
df.head()

,transaction_id,account_id,customer_name,transaction_date,transaction_type,amount,city
0,TXN1001,ACC001,Rahul Sharma,2024-01-05,Deposit,5000,Mumbai
1,TXN1002,ACC002,Ananya Verma,05/01/2024,withdrawal,2000,Delhi
2,TXN1003,ACC003,Rohit Singh,2024/01/06,Deposit,-3000,Bangalore
3,TXN1004,ACC001,rahul sharma,2024-01-06,Withdrawal,1500,mumbai
4,TXN1005,ACC004,Neha Patel,06-01-2024,NaN,4000,Ahmedabad

In [6]:
df.isnull().sum()

transaction_id      0
account_id          0
customer_name       1
transaction_date    0
transaction_type    1
amount              1
city                1
dtype: int64

In [7]:
df[df.isnull().any(axis=1)]

,transaction_id,account_id,customer_name,transaction_date,transaction_type,amount,city
4,TXN1005,ACC004,Neha Patel,06-01-2024,NaN,4000,Ahmedabad
5,TXN1006,ACC005,Amit Kumar,2024-01-07,Deposit,NaN,Pune
11,TXN1011,ACC007,NaN,2024-01-09,Deposit,7000,Chennai
13,TXN1013,ACC009,Sneha Iyer,2024-01-10,Deposit,8000,NaN

In [10]:
df['transaction_id'] = pd.to_datetime(df['transaction_date'],errors='coerce',dayfirst=True)

In [11]:
df['transaction_date']

0     2024-01-05
1     05/01/2024
2     2024/01/06
3     2024-01-06
4     06-01-2024
5     2024-01-07
6     2024-01-07
7     2024-01-08
8     2024-01-08
9     2024-01-09
10    2024-01-09
11    2024-01-09
12      09/01/24
13    2024-01-10
14    2024-01-10
Name: transaction_date, dtype: object

In [12]:
df

,transaction_id,account_id,customer_name,transaction_date,transaction_type,amount,city
0,2024-05-01,ACC001,Rahul Sharma,2024-01-05,Deposit,5000,Mumbai
1,NaT,ACC002,Ananya Verma,05/01/2024,withdrawal,2000,Delhi
2,NaT,ACC003,Rohit Singh,2024/01/06,Deposit,-3000,Bangalore
3,2024-06-01,ACC001,rahul sharma,2024-01-06,Withdrawal,1500,mumbai
4,NaT,ACC004,Neha Patel,06-01-2024,NaN,4000,Ahmedabad
5,2024-07-01,ACC005,Amit Kumar,2024-01-07,Deposit,NaN,Pune
6,2024-07-01,ACC006,Priya Nair,2024-01-07,Withdraw,2500,Kochi
7,2024-08-01,ACC002,Ananya Verma,2024-01-08,Deposit,3000,DELHI
8,2024-08-01,ACC003,Rohit Singh,2024-01-08,Deposit,3000,Bangalore
9,2024-09-01,ACC001,Rahul Sharma,2024-01-09,Withdrawal,1500,Mumbai
10,2024-09-01,ACC001,Rahul Sharma,2024-01-09,Withdrawal,1500,Mumbai
11,2024-09-01,ACC007,NaN,2024-01-09,Deposit,7000,Chennai
12,NaT,ACC008,Karan Mehta,09/01/24,withdrawal,abc,Jaipur
13,2024-10-01,ACC009,Sneha Iyer,2024-01-10,Deposit,8000,NaN
14,2024-10-01,ACC010,Arjun Rao,2024-01-10,Deposit,5000,Hyderabad

In [13]:
df.duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10     True
11    False
12    False
13    False
14    False
dtype: bool

In [14]:
df.drop_duplicates()

,transaction_id,account_id,customer_name,transaction_date,transaction_type,amount,city
0,2024-05-01,ACC001,Rahul Sharma,2024-01-05,Deposit,5000,Mumbai
1,NaT,ACC002,Ananya Verma,05/01/2024,withdrawal,2000,Delhi
2,NaT,ACC003,Rohit Singh,2024/01/06,Deposit,-3000,Bangalore
3,2024-06-01,ACC001,rahul sharma,2024-01-06,Withdrawal,1500,mumbai
4,NaT,ACC004,Neha Patel,06-01-2024,NaN,4000,Ahmedabad
5,2024-07-01,ACC005,Amit Kumar,2024-01-07,Deposit,NaN,Pune
6,2024-07-01,ACC006,Priya Nair,2024-01-07,Withdraw,2500,Kochi
7,2024-08-01,ACC002,Ananya Verma,2024-01-08,Deposit,3000,DELHI
8,2024-08-01,ACC003,Rohit Singh,2024-01-08,Deposit,3000,Bangalore
9,2024-09-01,ACC001,Rahul Sharma,2024-01-09,Withdrawal,1500,Mumbai
11,2024-09-01,ACC007,NaN,2024-01-09,Deposit,7000,Chennai
12,NaT,ACC008,Karan Mehta,09/01/24,withdrawal,abc,Jaipur
13,2024-10-01,ACC009,Sneha Iyer,2024-01-10,Deposit,8000,NaN
14,2024-10-01,ACC010,Arjun Rao,2024-01-10,Deposit,5000,Hyderabad

In [15]:
# TEXT CLEANING
df['transaction_type'] = df['transaction_type'].str.lower().str.strip()

In [20]:
# FIXING NAME INCONSISTENCIES
df['transaction_type']=df['transaction_type'].replace({'withdraw':'withdrawal'})

In [18]:
# CHECK UNIQUES VALUES
df['transaction_type'].unique()

array(['deposit', 'withdrawal', nan, 'withdrawl'], dtype=object)

In [21]:
df

,transaction_id,account_id,customer_name,transaction_date,transaction_type,amount,city
0,2024-05-01,ACC001,Rahul Sharma,2024-01-05,deposit,5000,Mumbai
1,NaT,ACC002,Ananya Verma,05/01/2024,withdrawal,2000,Delhi
2,NaT,ACC003,Rohit Singh,2024/01/06,deposit,-3000,Bangalore
3,2024-06-01,ACC001,rahul sharma,2024-01-06,withdrawal,1500,mumbai
4,NaT,ACC004,Neha Patel,06-01-2024,NaN,4000,Ahmedabad
5,2024-07-01,ACC005,Amit Kumar,2024-01-07,deposit,NaN,Pune
6,2024-07-01,ACC006,Priya Nair,2024-01-07,withdrawl,2500,Kochi
7,2024-08-01,ACC002,Ananya Verma,2024-01-08,deposit,3000,DELHI
8,2024-08-01,ACC003,Rohit Singh,2024-01-08,deposit,3000,Bangalore
9,2024-09-01,ACC001,Rahul Sharma,2024-01-09,withdrawal,1500,Mumbai
10,2024-09-01,ACC001,Rahul Sharma,2024-01-09,withdrawal,1500,Mumbai
11,2024-09-01,ACC007,NaN,2024-01-09,deposit,7000,Chennai
12,NaT,ACC008,Karan Mehta,09/01/24,withdrawal,abc,Jaipur
13,2024-10-01,ACC009,Sneha Iyer,2024-01-10,deposit,8000,NaN
14,2024-10-01,ACC010,Arjun Rao,2024-01-10,deposit,5000,Hyderabad

In [22]:
# HANDLINIG MISSING VALUES
df['transaction_type'] = df['transaction_type'].fillna('unkown')

In [23]:
# CONVERT NUMERIC VALUES
df['amount'] = pd.to_numeric(df['amount'],errors='coerce')

In [24]:
df['amount']

0     5000.0
1     2000.0
2    -3000.0
3     1500.0
4     4000.0
5        NaN
6     2500.0
7     3000.0
8     3000.0
9     1500.0
10    1500.0
11    7000.0
12       NaN
13    8000.0
14    5000.0
Name: amount, dtype: float64

In [25]:
# HANDEL MISSING AMOUNTS
df=df.dropna(subset=['amount'])

In [26]:
df

,transaction_id,account_id,customer_name,transaction_date,transaction_type,amount,city
0,2024-05-01,ACC001,Rahul Sharma,2024-01-05,deposit,5000.0,Mumbai
1,NaT,ACC002,Ananya Verma,05/01/2024,withdrawal,2000.0,Delhi
2,NaT,ACC003,Rohit Singh,2024/01/06,deposit,-3000.0,Bangalore
3,2024-06-01,ACC001,rahul sharma,2024-01-06,withdrawal,1500.0,mumbai
4,NaT,ACC004,Neha Patel,06-01-2024,unkown,4000.0,Ahmedabad
6,2024-07-01,ACC006,Priya Nair,2024-01-07,withdrawl,2500.0,Kochi
7,2024-08-01,ACC002,Ananya Verma,2024-01-08,deposit,3000.0,DELHI
8,2024-08-01,ACC003,Rohit Singh,2024-01-08,deposit,3000.0,Bangalore
9,2024-09-01,ACC001,Rahul Sharma,2024-01-09,withdrawal,1500.0,Mumbai
10,2024-09-01,ACC001,Rahul Sharma,2024-01-09,withdrawal,1500.0,Mumbai
11,2024-09-01,ACC007,NaN,2024-01-09,deposit,7000.0,Chennai
13,2024-10-01,ACC009,Sneha Iyer,2024-01-10,deposit,8000.0,NaN
14,2024-10-01,ACC010,Arjun Rao,2024-01-10,deposit,5000.0,Hyderabad

In [29]:
#CLEANING CITY COL.
df.loc[:,'city']=(df['city'].str.strip().str.title())

In [30]:
# FINAL CHECK

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 13 entries, 0 to 14
Data columns (total 7 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   transaction_id    10 non-null     datetime64[ns]
 1   account_id        13 non-null     object
 2   customer_name     12 non-null     object
 3   transaction_date  13 non-null     object
 4   transaction_type  13 non-null     object
 5   amount            13 non-null     float64
 6   city              12 non-null     object
dtypes: datetime64[ns](1), float64(1), object(5)
memory usage: 832.0+ bytes

In [32]:
df.isnull.sum()

AttributeError: 'function' object has no attribute 'sum'

In [ ]:
# SAVE TO CSV AFTER CLEANING
df.to_csv("cleaned_bank_transactions.csv", index=False)